print("Task 1:")
num1 = int(input("Введите начало диапазона: "))
num2 = int(input("Введите конец диапазона: "))
while num1 < 2:
    num1 += 1
for i in range(num1, num2 + 1):
    count = 0
    for el in range(1, i + 1):
        if i % el == 0:
            count += 1
    if count == 2: # count это число делителей, т.к у простого числа число делителей = 2
        print(i, "простое число")

print("\nTask 2:\n")
for i in range(1, 11):
    for el in range(1, 11):
        print(i, "*", el, "=", i * el, end=";\t")
    print("\n-------------------------------------------------------------"
          "------------------------------------------------------------") # для красоты

print("\nTask 3:\n")
num1 = int(input("Введите начало диапазона: "))
num2 = int(input("Введите конец диапазона: "))
for i in range(num1, num2 + 1):
    for el in range(1, 11):
        print(i, "*", el, "=", i * el, end=";\t\t")
    print("\n-------------------------------------------------------------"
        "-----------------------------------------------------------------------"
        "--------------------------")  # также для красоты









